# SELECT

In [4]:
import pandas as pd
import numpy as np

In [6]:
emp = pd.read_csv("./lec08_emp.csv",parse_dates=['HIREDATE'])
# emp.head(3)

In [8]:
emp.columns = emp.columns.str.lower()
emp.columns
## columns 이름 소문자로

Index(['empno', 'ename', 'job', 'mgr', 'hiredate', 'sal', 'comm', 'deptno'], dtype='object')

select * from emp:

In [4]:
emp

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

select ename from emp;

In [5]:
emp['ename']

0      SMITH
1      ALLEN
2       WARD
3      JONES
4     MARTIN
5      BLAKE
6        CCC
7      SCOTT
8       KING
9     TURNER
10     ADAMS
11     JAMES
12      FORD
13    MILLER
Name: ename, dtype: object

select  empno, ename from emp;

In [6]:
emp[['empno', 'ename']].head()

   empno   ename
0   7369   SMITH
1   7499   ALLEN
2   7521    WARD
3   7566   JONES
4   7654  MARTIN

In [95]:
emp.iloc[0] # 줄(단일값)

empno                        7521
job                      SALESMAN
mgr                        7698.0
hiredate      1981-02-22 00:00:00
sal                          1250
comm                        500.0
deptno                         30
deptno_str                     그외
job.np                   SALESMAN
1                        SALESMAN
1                        SALESMAN
Name: 2, dtype: object

In [8]:
emp.iloc[[0,1,2]] #줄[단일값,단일값,단일값]

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [9]:
emp.iloc[0,0] # 줄(단일값),칸(단일값)

7369

In [10]:
emp.iloc[0,[0,1]] #줄(단일값),칸[단일값,단일값]

empno     7369
ename    SMITH
Name: 0, dtype: object

In [11]:
emp.iloc[[0,1,2],[0,1]]  #줄[단일값,단일값,단일값], 칸[단일값,단일값]

   empno  ename
0   7369  SMITH
1   7499  ALLEN
2   7521   WARD

In [12]:
emp.iloc[0:3] # 줄 슬라이싱(0이상 3미만)

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [13]:
emp.iloc[0:3, 1:4]  # 줄 슬라이싱, 칸 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
1  ALLEN  SALESMAN  7698.0
2   WARD  SALESMAN  7698.0

In [14]:
emp.iloc[[0,2,5], 1:4] #줄[단일값,단일값,단일값], 칸(슬라이싱)

   ename       job     mgr
0  SMITH     CLERK  7902.0
2   WARD  SALESMAN  7698.0
5  BLAKE   MANAGER  7839.0

## loc[줄값, 칸값]
* 줄값 = 인덱스값
* 칸값 = 컬럼 이름

In [15]:
emp.loc[[1,2,3], 'empno']

1    7499
2    7521
3    7566
Name: empno, dtype: int64

In [16]:
emp.loc[[1,2,3], ['empno','ename']]

   empno  ename
1   7499  ALLEN
2   7521   WARD
3   7566  JONES

In [9]:
emp.loc[0:3,'empno':'mgr']
### 주의주의주의
### .loc[]슬라이싱할때 이상:이하 이다

   empno  ename       job     mgr
0   7369  SMITH     CLERK  7902.0
1   7499  ALLEN  SALESMAN  7698.0
2   7521   WARD  SALESMAN  7698.0
3   7566  JONES   MANAGER  7839.0

In [ ]:
emp.iloc[1:5,2:5]
#emp.iloc[[1,2,3,4],[2,3,4]]
# emp.loc[[1,2,3,4],['job','mgr','hiredate',]]
# emp.loc[1:4,'job':'hiredate']

## where 조건
* df[ 조건 ]
* df[ 조건 ][ 컬럼 ]
* df[ 컬럼 ][ 조건 ]

select * from emp where deptno = 10;

In [ ]:
emp[emp['deptno']==10 ]

select empno,ename from emp where deptno = 10;

In [ ]:
emp[['empno','ename']][emp['deptno']==10 ]

## 멀티조건
* and : &
* or : |
* 반드시 괄호로 묶어라 
* df[][ (조건) & (조건) ]
* df[][ (조건) | (조건) ]
* df[][ ( (조건) & (조건) ) | (조건) ] ---괄호먼저

select empno, ename, sal from emp where deptno = 10 and sal >2000;

In [ ]:
emp[ ['empno','ename','sal'] ] [ (emp['deptno']==10 ) & (emp['sal']>2000) ]

# subquery 비추

select ename, job from emp where job = (select job from emp where empno = 7369);

In [ ]:
job7369 = emp['job'][emp['empno']==7369].values[0]

In [ ]:
emp[['ename','job']][emp['job']== job7369]

select ename, job from emp where job in(select job from emp where deptno = 10);

In [ ]:
job10_arr= emp['job'][emp['deptno']==10]

In [ ]:
emp[['ename','job']][ emp['job'].isin(job10_arr)]

# 컬럼연산

컬럼 합치기
select job||ename from emp;
select concat(job, ename) from emp;

In [12]:
aa = emp['job'] + emp['ename']
aa.head()
## 타입이 다르면 안 된다('sal' + 'ename')

0        CLERKSMITH
1     SALESMANALLEN
2      SALESMANWARD
3      MANAGERJONES
4    SALESMANMARTIN
dtype: object

컬럼 연산
select sal, sal * 12 as asal from emp;

In [ ]:
emp['asal'] = emp['sal'] *12
## 원본 emp에 컬럼추가
emp['sal'] = emp['sal'] *12
## 원본 sal칼럼에 덮어쓰기

In [ ]:
emp.head()

# 결측처리
* df.dropna()
*  df['comm'].fillna(0) : nvl(comm,0)
*  df['comm'].isna() : where comm is null

select comm, nvl(comm,0) as comm2 from emp;

In [13]:
emp['comm2'] = emp['comm'].fillna(0)
emp[['comm','comm2']].head()

     comm   comm2
0     NaN     0.0
1   300.0   300.0
2   500.0   500.0
3     NaN     0.0
4  1400.0  1400.0

# 그룹
* 그룹함수 :mean(),max(),min(), count(),sum(), std()
* df.groupby('컬럼')

select deptno, count(empno) from emp group by deptno;

In [19]:
emp.groupby('deptno')['deptno'].count()

deptno
10    3
20    5
30    6
Name: deptno, dtype: int64

In [20]:
emp.groupby('deptno').first()

        empno  ename       job     mgr   hiredate   sal   comm
deptno
10       7782    CCC   MANAGER  7839.0 1981-06-09  2450    NaN
20       7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN
30       7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0

select deptno, sum(sal) from emp group by deptno;

In [25]:
emp.groupby('deptno')['sal'].sum()

deptno
10     8750
20    10875
30     9400
Name: sal, dtype: int64

In [26]:
emp.groupby('deptno').describe()

       empno                                                            \
       count         mean         std     min      25%     50%     75%
deptno
10       3.0  7851.666667   76.787586  7782.0  7810.50  7839.0  7886.5
20       5.0  7700.200000  227.508681  7369.0  7566.00  7788.0  7876.0
30       6.0  7686.000000  163.781562  7499.0  7554.25  7676.0  7807.5

                 mgr          ...     sal          comm                     \
           max count    mean  ...     75%     max count   mean         std
deptno                        ...
10      7934.0   2.0  7810.5  ...  3725.0  5000.0   0.0    NaN         NaN
20      7902.0   5.0  7732.2  ...  3000.0  3000.0   0.0    NaN         NaN
30      7900.0   6.0  7721.5  ...  1575.0  2850.0   4.0  550.0  602.771377


        min    25%    50%    75%     max
deptno
10      NaN    NaN    NaN    NaN     NaN
20      NaN    NaN    NaN    NaN     NaN
30      0.0  225.0  400.0  725.0  1400.0

[3 rows x 32 columns]

select deptno, max(sal), min(sal) from emp group by deptno;

In [35]:
emp.groupby('deptno')['sal'].max()
emp.groupby('deptno')['sal'].min()

deptno
10    1300
20     800
30     950
Name: sal, dtype: int64

In [32]:
emp.groupby('deptno').agg( {'sal':'max','comm':'min' } )
# agg > aggregation(합쳐라)

         sal  comm
deptno
10      5000   NaN
20      3000   NaN
30      2850   0.0

In [ ]:
emp.groupby('deptno').agg( {'sal':'max','sal':'min' } )
## X 안된다 딕셔너리에 같은 키 못쓴다

In [34]:
emp.groupby('deptno')['sal'].agg( ['max','min'] )
## emp.groupby('그룹할 컬럼')['보여줄 컬럼'].agg('함수1','함수2')

         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

select deptno, sum(sal),max(sal),min(sal),avg(sal),count(sal) from emp group by deptno;

In [42]:
emp.groupby('deptno')['sal'].agg(['sum','max','min','mean','count','std','var'])

          sum   max   min         mean  count          std           var
deptno
10       8750  5000  1300  2916.666667      3  1893.629672  3.585833e+06
20      10875  3000   800  2175.000000      5  1123.332097  1.261875e+06
30       9400  2850   950  1566.666667      6   668.331255  4.466667e+05

# 정렬
* df.sort_values()  --- 특정 column 기준으로 정렬
* df.sort_index()   ---index 기준으로 정렬
* df에서 꺼내진 컬럼에 대해서만 정렬이 가능
* emp[['ename','sal']]sort_values('deptno',ascending = True)  > X, 안 된다
* ascending=True/False로 오름차순,내림차순 표기
* ascending = 표기 안하면 asc이 기본

select sal from emp order by sal asc;

In [ ]:
emp.sort_index()
# emp.sort_index(ascending = False) --- 가능은 하다

In [46]:
emp['sal'].sort_values(ascending = True)
##emp['sal'].sort_values(ascending = False)

0      800
11     950
10    1100
2     1250
4     1250
13    1300
9     1500
1     1600
6     2450
5     2850
3     2975
7     3000
12    3000
8     5000
Name: sal, dtype: int64

select empno, ename,sal from emp where deptno = 20 order by ename asc;

In [50]:
emp[['empno','ename','sal']][emp['deptno']==20].sort_values('ename', ascending = True)

    empno  ename   sal
10   7876  ADAMS  1100
12   7902   FORD  3000
3    7566  JONES  2975
7    7788  SCOTT  3000
0    7369  SMITH   800

select empno, deptno,sal from emp order by deptno asc, sal asc;

In [ ]:
emp[['empno','deptno','sal']].sort_values(['deptno','sal'], ascending = True)

select empno, deptno,sal from emp order by deptno asc, sal desc;

In [ ]:
emp[['empno','deptno','sal']].sort_values(['deptno','sal'], ascending = [True,False])

# UPDATE
* df.[기존컬럼] = 신규값 > 수정
* df.[신규컬럼] = 값 > 신규컬럼생성

In [ ]:
emp['comm'] = 9999

## at / iat
* 단일값 변경
* df.at[줄값,칸값] = 변경값
* df.at[줄idx,칸값idx] = 변경값

update emp set ename = 'ssmith' where ename = smith

In [14]:
emp.at[0,'ename']='ssmith'
# 딱 하나의 값 변경
emp.head

<bound method NDFrame.head of     empno   ename        job     mgr   hiredate   sal    comm  deptno   comm2
0    7369  ssmith      CLERK  7902.0 1980-12-17   800     NaN      20     0.0
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30   300.0
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30   500.0
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20     0.0
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30  1400.0
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30     0.0
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10     0.0
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20     0.0
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10     0.0
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30     0.0
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20     0.0
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30     0.0
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20     0.0
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10     0.0>

update emp set job = 'sales' where deptno = 10;

In [ ]:
emp['job'][emp['deptno']==10] = 'sales10' 
## 에러, 가능은 하지만 다른 문법으로 안내한다

In [66]:
emp

    empno   ename       job     mgr   hiredate   sal    comm  deptno
0    7369     000     CLERK  7902.0 1980-12-17   800     NaN      20
1    7499     000  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE   MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC   sales10  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT   ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING   sales10     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER  SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS     CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES     CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD   ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER   sales10  7782.0 1982-01-23  1300     NaN      10

In [16]:
emp.iloc[0,0]

7369

## iloc / loc
* 여러값 변경
* df.loc[줄값,칸값] = 변경값
* df.iloc[줄idx,칸값idx] = 변경값

### np.where() vs df.where()
<pre>
*np.where(조건절, 참일때 출력값, 거짓일때 출력값) --- decode(deptno, 10, 'ten','esle')
*pd[컬럼 A].where(조건문, 거짓일때 출력값)   -----조건 만족하면 컬럼 A, 그렇지 않으면 입력값/조건 만족 못 하면 특정값으로 바꾸겠다/ 조건 만족,불만족 두가지 경우에 각각 특정값 두개를 넣으려 할 때는 사용 못함

In [ ]:
emp['deptno_str'] = np.where(emp['deptno']==10, '십', '그외')
emp

update emp set job = 'sales' where deptno = 10;

In [ ]:
emp['job.np'] = np.where(emp['deptno']==10, 'sales10', emp['job'])
emp.sort_values('deptno')

In [ ]:
emp[1] = emp['job'].where(emp['deptno']!=10, 'sales1010')
emp

# DELETE
* DML : delete from emp; -- 데이터 삭제 
* DDL : dop table emp;   -- 테이블객체 삭제
* drop(index,axis =0)    -- 데이터 행 삭제 
* drop(컬럼명,axis =1)     -- 데이터 열 삭제
* del df                 -- 테이블객체 삭제

In [ ]:
emp = emp.drop(1,axis=0)
emp
## 인덱스 값 1인 행(row) 삭제 / (단일값, 리스트, 슬라이싱 모두 가능)

In [ ]:
emp = emp.drop('ename',axis=1)
emp
## 'ename'열(column) 삭제 / (단일값, 리스트, 슬라이싱 모두 가능)

In [17]:
empcp = emp.copy()
empcp

    empno   ename        job     mgr   hiredate   sal    comm  deptno   comm2
0    7369  ssmith      CLERK  7902.0 1980-12-17   800     NaN      20     0.0
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30   300.0
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30   500.0
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20     0.0
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30  1400.0
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30     0.0
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10     0.0
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20     0.0
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10     0.0
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30     0.0
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20     0.0
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30     0.0
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20     0.0
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10     0.0

In [18]:
del empcp
## drop table과 유사 / pd.read_csv() 다시 읽어들여야 함

In [19]:
empcp
##  name 'empcp' is not defined / 메모리에서 삭제

NameError: name 'empcp' is not defined